"use client";
import Image from "next/image";

export default function AboutUsSection() {
  return (
    <section className="py-16 px-6 bg-white">
      <div className="max-w-6xl mx-auto">
        <div className="relative w-full md:h-auto h-96 rounded-2xl overflow-hidden shadow-md">
          <Image
            src="/about.png"
            alt="আমাদের কথা"
            width={1603}
            height={1069}
            className="object-cover w-full h-full"
          />
        </div>
        <div className="mt-10 text-gray-800">
          <h2 className="md:text-4xl text-3xl font-bold text-gray-900 mb-4 border-b-2 border-primary inline-block pb-2">
            আমাদের কথা
          </h2>
          <p className="leading-relaxed text-justify text-lg text-gray-700">
            নিজস্ব জমিতে নিজের একটি বাড়ী মানুষের আজন্মলালিত স্বপ্ন। আমরা যারা
            ঢাকা শহরের নাগরিক জীবনে অভ্যস্ত তারা সবাই চাই ঢাকায় একটি নিজম্ব
            আবাসন। কিন্তু দুষ্প্রাপ্যতার কারণে ঢাকায় জমি এখন সোনার চেয়ে দামী।
            তাছাড়া মূল শহরে বাণিজ্যিক ব্যস্ততার কারনে আবাসিক এলাকার স্বাদ পাওয়া
            যায়না। একারণে আমরা সকলেই চাই রাজধানী সংলগ্ন এলাকায় একটুকরো জমি।
            যেখানে সকল আবাসিক সুবিধাদি বিদ্যমান। ইতোমধ্যে রাজধানী উন্নয়ন
            কর্তৃপক্ষ (রাজউক) শহর সংলগ্ন এলাকায় নতুন নতুন উপশহর তৈরীর প্রকল্প
            বাস্তবায়ন করছে। কিন্তু ইচ্ছা থাকা সত্ত্বেও এসব প্রকল্পে সবাই প্লট
            বরাদ্দ পান না বা পাওয়া সম্ভব হয় না। এ অবস্থা বিবেচনা করে পুলিশ
            বাহিনীর সদস্যদের জন্য পুলিশ বিভাগে কর্মরত কিছু সদস্য “আনন্দ পুলিশ
            পরিবার কল্যাণ বহুমুখী সমবায় সমিতি গঠন পূর্বক আবাসন প্রকল্প
            বাস্তবায়নের উদ্যোগ গ্রহণ করে। ঢাকা জেলা সমবায় রেজিষ্ট্রার কর্তৃক
            এটি নিবন্ধিত। এর নিবন্ধন নং-১১৩৬।পুলিশ বাহিনীতে কর্মরত অথবা সাবেক
            কর্মকর্তাগন এবং তাদের আত্মীয়গন এখানে প্লটের জন্য আবেদন করতে পারেন।
            আবাসিক প্রকল্পটির বহুমাত্রা নিশ্চিত করার লক্ষ্যে সমাজে প্রতিষ্ঠিত
            অন্যান্য পেশার লোকদের জন্য এই প্রকল্পে প্লট বরাদ্দ দেওয়া হচ্ছে।
          </p>
        </div>
      </div>
    </section>
  );
}
